Autodesk.Revit.UI.ContextMenuManager.AddContextMenuCreator(System.String,Autodesk.Revit.UI.IContextMenuCreator)
Add a context menu creator.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.UI.ContextMenuManager.GetSingletonContextMenuManager
Get the singleton of ContextMenuManager.
Since:
2025

Autodesk.Revit.UI.ContextMenuManager.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.ContextMenuManager.#ctor
Default constructor.
Since:
2025

Autodesk.Revit.UI.ContextMenuManager
A class to manage context menu creators.
Since:
2025